saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/SONiX.SN32F2_DFP.1.2.10.pdsc
	   <!-- *************************  Device 'SN32F246BJ'  ***************************** -->
      <device Dname="SN32F246BJ">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="39"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="23"/>
        <feature type="QFN"           n="46"/>
      </device>
	  
	   <!-- *************************  Device 'SN32F2451BJ'  ***************************** -->
      <device Dname="SN32F2451BJ">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="24"/>
        <feature type="ADC"           n="6"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="17"/>
        <feature type="QFN"           n="33"/>
      </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="SN32F23_4">
      <description>SONiX SN32F2230_40 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F23??"/>
      <accept Dvendor="SONiX:110" Dname="SN32F24??"/>
    </condition>
	
    <condition id="SN32F26">
      <description>SONiX SN32F260 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F26*"/>
    </condition>
	
	<condition id="SN32F240B">
      <description>SONiX SN32F240B Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F24*B*"/>
    </condition>
	
    <condition id="SN32F23_4 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F230_40 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F23_4"/>
    </condition>

	<condition id="SN32F26 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F260 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F26"/>
    </condition>
	
	<condition id="SN32F240B CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F240B Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F240B"/>
    </condition>
	
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.1" condition="SN32F23_4 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F230_40 Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F240.s"    attr="config"	version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F240.c"         attr="config"    version="1.1.1"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="SN32F26 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F260 Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F260.s"    attr="config"	version="1.0.2"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F260.c"         attr="config"    version="1.0.3"/>
      </files>
    </component>
	
	<component Cclass="Device" Cgroup="Startup" Cversion="1.1.1" condition="SN32F240B CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F240B Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F240B.s"    attr="config"	version="1.1.1"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F240B.c"         attr="config"    version="1.0.2"/>
      </files>
    </component>
	
  </components>
</package>
